[
    [
        1,
        "Cómo instalar Python y crear entornos virtuales",
        "https://api.binary-coffee.dev/uploads/ca301e6aad8b47a799627372827d3ba5.jpg",
        "Python es uno de los lenguajes de programación más usados y queridos por los programadores, todo esto debido a su simpleza, elegancia y flexibilidad. Es un lenguage multiplataforma por lo cual está diponible para Mac, Linux y Windows. En este artículo te vamos a enseñar a instalarlo de manera sencilla y a crear ambientes virtuales para nuestros proyectos.",
        "2020-03-04",
        "https://binary-coffee.dev/post/como-instalar-python-y-crear-entornos-virtuales",
        1
    ],
    [
        2,
        "Cómo hacer un Bot de Telegram desde cero con Python",
        "https://api.binary-coffee.dev/uploads/aa40fc1de14d4678a670c841f720b4ee.jpg",
        "En este artículo te enseñaremos como crear un bot para Telegram desde cero con Python, asumiendo que posees conocimientos básicos de programación. Este bot se encargará de buscar noticias en internet en consecuencia de lo que el usuario desee, haciendo uso de los servicios que brinda NewsApi.",
        "2020-03-04",
        "https://binary-coffee.dev/post/como-hacer-un-bot-de-telegram-desde-cero-con-python",
        1
    ],
    [
        3,
        "Guía para escribir en internet con MarkDown",
        "https://api.binary-coffee.dev/uploads/c0c6acd02f474a3f9b77e797f29342f2.jpg",
        "Markdown está diseñado para escribir textos legibles de una manera sencilla, una de sus principales ventajas es que se guarda en texto plano por lo que puede ser editado desde cualquier aplicación en cambio si creamos un documento Word y lo abrimos desde el bloc de notas, no se podrá distinguir el contenido. Si quieres formar parte de esta generación de revistas y publicaciones online o simplemente si quieres ampliar tus conocimientos quédate y lee hasta el final.",
        "2020-03-04",
        "https://binary-coffee.dev/post/guia-para-escribir-en-internet-con-markdown",
        1
    ],
    [
        4,
        "Aprende a desplegar un bot de Telegram en Heroku",
        "https://api.binary-coffee.dev/uploads/c74938938e7e4d6ca9f40c6b7c74b3d8.png",
        "Heroku es uno de los PaaS (Platform as a Service) más utilizados en la actualidad por su fuerte enfoque en resolver el despliegue de una aplicación. Permite manejar los servidores, sus configuraciones y la administración. A Heroku solo le dices qué lenguaje de backend estás utilizando o qué base de datos y te preocupas únicamente por el desarrollo de tu aplicación.",
        "2020-03-04",
        "https://binary-coffee.dev/post/aprende-a-desplegar-un-bot-de-telegram-en-heroku",
        1
    ],
    [
        5,
        "¿Qué es un hacker? Algunos ejemplos geniales.",
        "https://api.binary-coffee.dev/uploads/f6a2c201264f4cda9070d9c70ce9009b.jpg",
        "El uso del término hacker no se limita solo a la seguridad informática pues es toda aquella persona que le da un uso a una tecnología para el cual no estaba diseñado inicialmente.",
        "2020-03-04",
        "https://binary-coffee.dev/post/que-es-un-hacker-algunos-ejemplos-geniales",
        1
    ],
    [
        6,
        "¿Qué es el intercambio de recursos de origen cruzado (CORS)?",
        "https://api.binary-coffee.dev/uploads/d090e67cd6e84bb98b07204280816819.png",
        "¿Qué es el intercambio de recursos de origen cruzado? ¿Cuáles son sus ventajas? ¿Para que se utilizan? Lee este artículo para aclarar esas preguntas!",
        "2020-03-04",
        "https://binary-coffee.dev/post/que-es-el-intercambio-de-recursos-de-origen-cruzado-cors",
        1
    ],
    [
        7,
        "6 Herramientas que mejoraron mi productividad y deberías probar",
        "https://api.binary-coffee.dev/uploads/e8c0bc1bae4d46a88c0d7e8114d47e12.jpeg",
        "En este artículo te voy a enseñar un conjunto de herramientas y plataformas que han mejorado mi productividad en los últimos meses. Desde plataformas que me permiten enfocarme en el trabajo hasta herramientas que hacen mi vida más sencilla. Si te interesa el tema continua leyendo.",
        "2020-03-04",
        "https://binary-coffee.dev/post/6-herramientas-que-mejoraron-mi-productividad-y-deberias-probar",
        1
    ],
    [
        8,
        "Cómo aplicar para GitHub Education Pack",
        "https://api.binary-coffee.dev/uploads/c0d33209daba4e81911dd36ea75e8a7f.jpg",
        "¿Qué es GitHub? ¿Qué es GitHub Education Pack? ¿Cómo aplicar? Esperamos que puedas aclarar esas dudas con nosotros.",
        "2020-03-04",
        "https://binary-coffee.dev/post/como-aplicar-para-github-education-pack",
        1
    ],
    [
        9,
        "Cómo hacer deploy a nuestro portafiolio con React a GitHub Pages y no morir en el intento?",
        "https://api.binary-coffee.dev/uploads/f9654de9573a460a8f9a882037733fce.png",
        "GitHub te permite hostear tus páginas web estáticas en sus servidores, pensado para que se pudiera tener la documentación de proyectos o simplemente para que los usuarios pudieran crear sus portafolios. Hacer esto último me tomó mucho más de un mes y varios gigas de internet. En este artículo te mostraremos una de las maneras de hacerlo, así que continúa leyendo.",
        "2020-03-04",
        "https://binary-coffee.dev/post/como-hacer-deploy-a-nuestro-portafiolio-con-react-a-github-pages-y-no-morir-en-el-intento",
        1
    ],
    [
        10,
        "Un proyecto para aprender a programar desde tempranas edades",
        "https://api.binary-coffee.dev/uploads/906ad2f94bdb408084902521fc981525.jpg",
        "¿Por qué aprender a programar desde edades tempranas? ¿Sabes qué es Scratch? ¿Conoces la comunidad Scratchers Cuba?",
        "2020-03-04",
        "https://binary-coffee.dev/post/un-proyecto-para-aprender-a-programar-desde-tempranas-edades",
        1
    ],
    [
        11,
        "Generando códigos QR con Python",
        "https://api.binary-coffee.dev/uploads/17868fbae240401a861f990569564a50.png",
        "Un código QR (Quick Response Code o Código Respuesta Rápida) es la evolución del código de barras. Es un módulo para almacenar información en una matriz de puntos o en un código de barras bidimensional. Es muy usado en la actualidad debido a que puede ser escaneada por un celular y de forma inmediata nos lleva a una aplicación en internet, mapa de localización, correo electrónico o perfil en una red social.",
        "2020-03-04",
        "https://binary-coffee.dev/post/generando-codigos-qr-con-python",
        1
    ],
    [
        12,
        "Creando una API con Django y Graphene",
        "https://api.binary-coffee.dev/uploads/0f3b169338ad4984a1dbcc22b567bd8c.png",
        "En este tutorial crearemos una simple API GraphQL utilizando Django y Graphene.\r\n\r\nGraphQL permite al cliente decidir qué datos pedir al servidor, lo que quiere decir que, si se necesitara información adicional, o si simplemente deja de necesitar un dato, no tiene que modificar el backend solamente la query GQL.",
        "2020-03-04",
        "https://binary-coffee.dev/post/creando-una-api-con-django-y-graphene",
        1
    ],
    [
        13,
        "3 Formas de darle estilos a tus formularios de Django",
        "https://api.binary-coffee.dev/uploads/f35583e679d0429498da53fc40911fef.png",
        "En este artículo veremos tres de las formas de darle estilo a tus formularios de Django con Bootstrap cuando usamos las vistas basadas en clases: Create/Update View. ¿No sabes cómo hacerlo? ¿Te interesa el tema? Lee este post para que descubras nuevas maneras de hacerlo y compartas tu conocimiento con nosotros.",
        "2020-03-21",
        "https://binary-coffee.dev/post/3-formas-de-darle-estilos-a-tus-formularios-de-django",
        1
    ],
    [
        14,
        "Manejando Hojas de Cálculo con Python",
        "https://api.binary-coffee.dev/uploads/6e340ac2536b4081b3c43dd6938135b3.png",
        "En este artículo aprenderemos a manejar hojas de cálculo con Python y su biblioteca openpyxl.",
        "2020-05-18",
        "https://binary-coffee.dev/post/manejando-hojas-de-calculo-con-python",
        1
    ],
    [
        15,
        "Usando Chart.js en Django",
        "https://api.binary-coffee.dev/uploads/72c8a0f18a604a30948137a112e24363.png",
        "Te enseñaré a crear y configurar tu primer gráfico de líneas con Chart.js y Django de la manera más sencilla que conozco, lo único que necesitas tener: es un proyecto con Django.",
        "2020-05-18",
        "https://binary-coffee.dev/post/usando-chartjs-en-django",
        1
    ],
    [
        16,
        "SimpleAnalytics: una alternativa a Google Analytics",
        "https://api.binary-coffee.dev/uploads/b37d53ec23104191a5492e610d798dde.png",
        "SimpleAnalytics es una startup de código libre, que como su nombre dice nos da analiticas de una manera sencilla. Tienen votaciones en las que pueden participar sus usuarios para decidir las próximas funcionalidades a implementar.",
        "2020-05-18",
        "https://binary-coffee.dev/post/simpleanalytics-una-alternativa-a-google-analytics",
        1
    ],
    [
        17,
        "[2020] Proyectos open source más populares en GitHub",
        "https://binary-coffee.dev/assets/images/banner-default.jpg",
        "GitHub muy contrario a lo que su nombre indica se ha convertido en el principal potenciador de los proyectos open source. Lee este blog post para conocer cuales son los proyectos más populares hasta mayo de 2020 basado en la cantidad de estrellas.",
        "2020-05-18",
        "https://binary-coffee.dev/post/2020-proyectos-open-source-mas-populares-en-github",
        1
    ],
    [
        18,
        "Enviar correos con Python usando Gmail",
        "https://api.binary-coffee.dev/uploads/1c3fd94507614a818c131483990747b6.png",
        "En este tutorial usaremos la biblioteca smtplib, viene incluida con python por lo que no es necesario instalarla, que permite el envío de correos a cualquier dirección en internet con un servidor SMTP(Simple Mail Transfer Protocol).",
        "",
        "https://binary-coffee.dev/post/enviar-correos-con-python-usando-gmail",
        1
    ],
    [
        19,
        "Plataformas para practicar tus habilidades algorítmicas",
        "https://api.binary-coffee.dev/uploads/26672911606_dabca0d666_b_b035865f01.jpeg",
        "Muchos comenzamos en el mundo de la programación aprendiendo algoritmia y es probable que no hayas tenido acceso a problemas diferentes a los que te ponían en clase o donde verdaderamente pudieras comprobar hasta que punto estabas avanzando. Hoy te traemos 4 plataformas para que puedas practicar tus habilidades algorítmicas.",
        "",
        "https://binary-coffee.dev/post/plataformas-para-practicar-tus-habilidades-algoritmicas",
        1
    ],
    [
        20,
        "BootHole, un error crítico en GRUB2 está afectando millones de sistemas Linux",
        "https://api.binary-coffee.dev/uploads/Boot_Hole_13db81716a.png",
        "GRUB2 es un software que está incluido en la gran mayoría de distribuciones Linux y cuya principal función es la de gestionar el arranque de nuestro equipo. Suele pasar desapercibido a no ser que se cuente con múltiples sistemas operativos, donde debemos seleccionar que sistema iniciará.",
        "",
        "https://binary-coffee.dev/post/boothole-un-error-critico-en-grub2-esta-afectando-millones-de-sistemas-linux",
        1
    ],
    [
        21,
        "Python: convertir de binario a decimal y viceversa",
        "https://api.binary-coffee.dev/uploads/Agregar_un_titulo_c842d75789.png",
        "En este artículo te enseñamos a convertir de decimal a binario y de binario a decimal. Lee para que entiendas el proceso de conversión y conozcas más sobre estos sistemas de numeración.",
        "",
        "https://binary-coffee.dev/post/python-convertir-de-binario-a-decimal-y-viceversa",
        1
    ],
    [
        21,
        "CREAR UNA PÁGINA COMING SOON EN WORDPRESS",
        "https://api.binary-coffee.dev/uploads/webfactory_ltd_Cqjib_Ee_TU_ts_unsplash_8228973bb2.jpeg",
        "Crear una página Coming Soon ayudará a que tu sitio web comience a aparecer en la lista de resultados de los buscadores.",
        "",
        "https://binary-coffee.dev/post/wordpress-coming-soon",
        1
    ],
    [
        22,
        "CREA REDIRECCIONES 301 EN WORDPRESS",
        "https://api.binary-coffee.dev/uploads/markus_winkler_3h_BH_Zuvpp_U_unsplash_77d74bf5b4.jpeg",
        "Una redirección 301 indica que la página solicitada se ha movido permanentemente a la dirección URL de destino y ayuda a pasar el tráfico de direcciones URL solicitadas de una manera amigable con el motor de búsqueda.",
        "",
        "https://binary-coffee.dev/post/crea-redirecciones-301-con-easy-redirect-manager",
        1
    ],
    [
        23,
        "YA ESTÁ DISPONIBLE GITHUB CLI 1.0: Estas son sus NOVEDADES",
        "https://api.binary-coffee.dev/uploads/Screenshot_2020_09_17_Git_Hub_CLI_7a235e1a32.png",
        "A principios de este año se anunció la versión beta de GitHub CLI. Desde que se lanzó la versión beta, los usuarios han creado más de 250.000 pull requests, realizado más de 350.000 merges y creado más de 20.000 issues con GitHub CLI.",
        "",
        "https://binary-coffee.dev/post/ya-esta-disponible-github-cli-10",
        1
    ],
    [
        24,
        "ESTOS LOS MEJORES PROGRAMADORES DEL MUNDO",
        "https://api.binary-coffee.dev/uploads/Los_Mejores_Programadores_0b0d0eac80.png",
        "Cuando se suele conversar entre programadores estos son algunos de los nombres que suenan a MEJOR PROGRAMADOR del MUNDO. Indudablemente son muchos y es posible que se quede alguno.",
        "",
        "https://binary-coffee.dev/post/estos-los-mejores-programadores-del-mundo",
        1
    ],
    [
        25,
        "DESPLIEGA NUXT A GITHUB PAGES EN 2020",
        "https://api.binary-coffee.dev/uploads/Azul_Marketing_Estrategias_Blog_Banner_41e3eb6628.png",
        "Nuxt es un framework web basado en Vue.js, Node.js, Webpack y Babel.js. Viene a solucionar el tema de las configuraciones, que eran mucho más complicadas con Vue.js, ya que hace que este proceso sea realmente fácil y muy sencillo.",
        "",
        "https://binary-coffee.dev/post/desplegar-nuxt-github-pages",
        1
    ],
    [
        26,
        "HOSTING GRATIS: PLATAFORMAS PARA TUS PROYECTOS FRONTEND",
        "https://api.binary-coffee.dev/uploads/Negro_Blanco_Foto_Luna_Blog_Banner_2_827e8fc198.png",
        "Vivo en Cuba un país muy atrasado en cuestiones tecnológicas, por ello cada día los emprendedores encuentran cientos de ideas que solucionan problemas de la sociedad y muchos nunca llegan a implementarlas.",
        "",
        "https://binary-coffee.dev/post/hosting-gratis",
        1
    ]
]